[
  {
      "id": 0,
      "name": "Emerald Dal",
      "ingredients": ["3 tablespoons ghee", "1 onion, diced", "4 cloves garlic, rough chopped", "2 tablespoons ginger, finely chopped", "1 medium jalapeno, finely chopped (or 1 serrano)", "1/2 teaspoon fennel seeds", "1 teaspoon black mustard seeds", "2 teaspoon cumin seeds", "2 teaspoons garam masala", "1 lb baby spinach (fresh or frozen)", "10 mint leaves", "1 teaspoon dried fenugreek leaves", "2 tablespoons water (if using fresh spinach)", "1/2 cup plain yogurt", "3 –4  cups cooked black lentils (or aka caviar lentils, beluga lentils or French green lentils)", "1 teaspoon salt"],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618509946/f1_tmal63.jpg",
      "instructions": ["If cooking black lentils and basmati rice, start them first (see notes)", "Make the Spinach Sauce: Sautee the onion in ghee, in a large pan, over medium heat for 3-4 minutes, then add garlic, ginger and chilies. Saute until fragrant and golden. Add the fennel seeds, mustard seeds, cumin seeds and garam masala and stir two minutes. Lower heat to low. Add the fresh spinach, mint, fenugreek and water. Cover pan, 2-3 minutes, letting spinach wilt. Give a few stirs.", "Blend Spinach Sauce: Place the wilted spinach mixture in a blender and add the 3/4 cups water. Pulse and few times (hold lid down tight). If you want a smooth sauce, blend until smooth. I left a little texture here.  Pour it back into the pan, set on low heat.", "Combine: Stir in the yogurt, lentils and salt. Taste. Adjust salt to your liking, adding more if necessary! You want this slightly salty because you are serving over rice which will mellow it out a lot. For more heat add a pinch of cayenne or chili flakes. To “up” the flavor add a bit more garam masala spice to taste. If you want a little acidity a tiny squeeze of lemon is nice.", "Serve with the basmati rice and naan bread!"]
  },
  {
      "id": 1,
      "name": "Broccoli Cakes",
      "ingredients": ["1/2 cup uncooked quinoa (or sub 1 1/2 cups cooked quinoa)", "4–5 cups fresh broccoli florets (8 ounces)", "1 scallion, diced", "1/4 chopped herbs- basil, dill, Italian parsley, or cilantro (use what you have)", "1 egg", "1 teaspoon salt", "1/4 teaspoon pepper", "1 garlic clove, finely minced (or 1/2 teaspoon granulated garlic)", "1/4 cup almond flour (or use bread crumbs), more as needed", "1/2 cup grated cheese (cheddar, jack, mozzarella or vegan cheese)", "2–3 tablespoons oil for searing." ],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506668/MyVeggieWeek/broccoli-cakes_xx4txa.jpg",
      "instructions": ["Cook Quinoa: Rinse quinoa in a fine-mesh strainer. Drain. Bring quinoa and 1 cup water to boil in a very small pot, cover, lower heat to low and simmer 10-12 minutes until tender and all the water is gone. Turn off heat, let stand 5 minutes covered.", "Steam broccoli: While cooking the quinoa, steam the broccoli until tender, being careful not to overcook. Drain well, let cool, and pat dry. (It is imperative that broccoli is not overcooked and is patted dry in order for cakes to stick together.)", "Combine and Pulse: Place broccoli, scallions, cooked quinoa, egg, salt, pepper, garlic, and cheese into a food processor and pulse repeatedly until finely ground. Pulse in the almond flour, mixing in well. The mixture should easily mound on a spoon and just be slightly sticky, easily forming a patty. If the mixture seems very wet, continue adding almond flour a tablespoon at a time until manageable.  With damp hands, Form 4 large patties, pressing them together. You shouldn’t need to coat these in flour or breadcrumbs- but if they feel very wet, feel free to.", "Sear: Heat oil in a skillet over medium heat. Carefully place patties in the skillet, lowering heat to medium-low or low — resisting the temptation to move or fiddle with them. As they form the deep golden crust, they will naturally release themselves from the pan, and not stick- making flipping so much easier.  (I like to use a thin metal spatula here. Rubber spatulas have thicker edges, much harder to get under delicate things.) Flip when golden and releasing, about 5 minutes.  Pan-sear the other side until slightly puffed in the center (indicating the egg is cooked through) lowering heat more if need be. You can also finish cooking these through in 350F oven after pan-searing if they are getting too dark on the stovetop.", "SERVE: At this point, you could refrigerate if making ahead, and reheat down the road. Or keep in a warm oven until serving. Serve with a slaw, side salad or sauteed greens. Top with a flavorful sauce if you like (see options in notes)."]
  },
  {
      "id": 2,
      "name": "Butternut Risotto with Leeks",
      "ingredients": ["2 tablespoons olive oil (or butter)", "2 cups sliced leeks (one extra large leek)", "4 garlic cloves, rough chopped", "8 sage leaves, chopped", "1 cup Arborio rice or short-grain Spanish rice (Bomba)", "2 heaping cups butternut squash, cubed", "1/4 cup white wine (or skip it)", "2 cups veggie stock or chicken stock or broth (or water and one teaspoon or cube veggie bouillon)", "1/2 teaspoon salt", "1/8  teaspoon white pepper (or sub black pepper to taste)", "1/2 teaspoon nutmeg the nutmeg makes this- don’t leave it out!", "2–3 handfuls baby spinach or chopped kale", "OPTIONAL: 1/4 – 1/2 cup parmesan, pecorino, manchego, goat cheese, vegan cheese or cashew cheese – or the leave cheese out and use LEEK OIL for garnish. Or stir in 1-2 tablespoons of butter or ghee, or a drizzle of olive oil."],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506668/MyVeggieWeek/Instant-Pot-Butternut-Risotto_dznbvg.jpg",
      "instructions": ["Slice and rinse leeks, separating rings (rinsing will help them to soften faster).", "Set Instant Pot to the “Saute” function.", "Heat oil in the instant pot, add the rinsed leeks and stir for 2 minutes. Add garlic, sage and rice, stir for 2 minutes.", "Add butternut squash, and keep stirring for a couple of minutes, until there is a bit of browning on the bottom of the instant pot.", "Add the wine and scrape up the browned bits-  a wooden spoon is good for this. Let all the wine cook off, about 2-3 minutes. Add the stock or broth. Scrape up more browned bits. Add the salt, pepper and nutmeg, and give a good stir.", "Seal the instant pot and pressure cook on HIGH for 6 minutes. Naturally, release for 5 minutes, then manually release. ", "While the Instant pot is going you could make the leek oil and/or the maple glazed pecans.", "Stir the risotto, adding the spinach and cheese or butter if you like, or leave them out. As the butternut breaks down a bit, it will add a nice natural creaminess to the risotto.", "Garnish with optional leek oil or maple glazed pecans."]
  },
  {
      "id": 3,
      "name": "Farmers Market Veggie Enchiladas",
      "ingredients": ["1–2 tablespoons olive oil", "1 onion diced", "4 garlic cloves, rough chopped", "1 red bell pepper diced", "1 small yam,  diced small ( or sub zucchini)", "1/2 teaspoon salt", "1 ear of corn, kernels cut off (about 1 cup) or sub other veggies!", "1  teaspoon cumin", "1 teaspoon coriander", "1 teaspoon dried oregano", "1  14-ounce can black beans rinsed, drained", "1/4 cup chopped cilantro ( optional)", "2 cups homemade enchilada sauce (or store-bought)", "8 x 8-inch whole wheat tortillas ( or sub corn)", "2 cups grated cheese (8–10 ounces pepper jack, Mexican blend, cheddar, Mozzarella) or sub vegan cheese!", "Garnishes: sour cream, avocado, pickled red onions and hot sauce."],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506669/MyVeggieWeek/Vegetarian-Enchiladas_updrko.jpg",
      "instructions": ["Preheat oven to 400 F", "If making the homemade enchilada sauce, place all ingredients in a blender and blend until smooth.", "Make the filling: Heat oil in a large skillet over medium-high heat. Add onion and stir 2-3 minutes until fragrant. Lower heat to medium add bell pepper, yams, garlic and salt. Saute this until yams and peppers are tender about -7-9 minutes. If mixture gets dry, add a splash of water, lower heat and cover and gently steam until yams are fork-tender. Fold in the fresh corn and cumin, coriander and oregano. Saute 3 more minutes. Remove from heat. Add the black beans, taste for salt, adding more if you like. Stir in half the cilantro.", "Grease a 9 x 13 baking dish. Pour 1/2 cup of the enchilada sauce and spreading around so the bottom of the pan is nicely coated.", "Assemble your Enchiladas: Place 1/2 cup filling down the center of the tortilla add 2-3 tablespoons grated cheese over top and wrap it up tightly. Place enchilada seam side down over the sauce. Repeat with the remaining 7 tortillas nestling them side by side. Pour the remaining Enchilada Sauce over the enchiladas, leaving the edges exposed if you like (for crispy edges). Sprinkle with remaining cup of cheese.", "Place in the hot oven, foiled for 20 minutes then uncover for the last 6-10 minutes until cheese is nice and melty. Let stand 10-15 minutes before serving ( tented with foil). Scatter the remaining chopped cilantro over the enchiladas. Serve with sour cream and hot sauce.", "Serve with Mexican Slaw!"]
  },
  {
      "id": 4,
      "name": "Baked Ziti with Spinach & Mushrooms",
      "ingredients": ["2 tablespoon olive oil", "1 onion, chopped", "4 garlic cloves, rough chopped", "16 ounces mushrooms, sliced (cremini, portobello, or sub ground meat or sausage)", "¼ teaspoon salt", "1/2 teaspoon pepper", "1/2 teaspoon chili flakes", "2 teaspoons Italian seasoning", "3–4 ounces baby spinach, chopped  ( about 2 great big handfuls) or use 1-2 cups frozen spinach", "2 cups  veggie broth  (or chicken broth)", "1 x 24-25 ounce jar marinara sauce– Trader joe’s organic brand is really tasty -see notes", "8 ounces dry ziti pasta or penne pasta, or similar", "1 cup ricotta cheese, or herbed tofu ricotta", "¼–1/2 cup finely grated pecorino or parmesan (optional)", "1/2– 1 cup grated mozzarella cheese ( or sub vegan cheese)", "garnish with fresh basil (or Italian parsley) and chili flakes."],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506668/MyVeggieWeek/No-Boil-Mushroom-Baked-Ziti_giteqc.jpg",
      "instructions": ["Preheat oven to 400 F", "In a large, 12-inch skillet, heat oil over medium heat, add onion, garlic and mushrooms and season generously with salt and pepper,  cooking and stirring until mushrooms release all their liquids and this cooks off, and eventually they get golden brown, about 12 minutes. Taste and make sure these are salted and flavorful.", "Add fresh spinach and wilt, then add 2 cups of broth or stock, a jar of marinara sauce and the dry pasta (about 2 ¾-3 cups dry). Stir, and bring to a simmer. Dot with the dollops of ricotta. Sprinkle with mozzarella and pecorino.  Cover well and place in the oven to bake for 30 minutes.", "Uncover and let the cheese get a little golden for a couple of minutes (feel free to broil).  If there seems to be too much liquid left in the pan, simply simmer uncovered on the stovetop for 1-2 minutes until it evaporates.", "Garnish with fresh herbs and chili flakes."]
  },
  {
      "id": 5,
      "name": "Moroccan Sweet Potatoes",
      "ingredients": ["2–3 medium yams- cut in half lengthwise, skin on", "1 Tablespoon olive oil", "½ an onion – diced", "½ an apple – diced", "4 garlic cloves, rough chopped", "1 can chickpeas, drained & rinsed or sub ½ lb chicken breast", "2 teaspoons Ras el Hanout spice blend", "½ teaspoon salt", "¼ teaspoon pepper", "2 teaspoon maple syrup", "½ cup chopped cilantro, divided", "¼ cup chopped scallions"],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506668/MyVeggieWeek/moroccan-sweet-potato_h4559o.jpg",
      "instructions": ["Preheat oven to 400F.", "Place yams, cut side down on parchment lined baking sheet and roast for 30-40 minutes until tender.", "While yams are roasting make filling. Saute onion and apple in olive oil, in a large skillet, over medium high heat for 2-3 minutes. turn heat to medium. Add garlic. Saute 4 more minutes then add chick peas and spices, salt and pepper. Continue cooking a few more minutes. Stir in maple syrup. At this point, it may seem a little spicy, but when stuffed into the sweet potato, the flavors will mellow a bit. Stir in half of the cilantro. Turn heat off.", "When yams are tender, flip them right side up, and slit the middle gently with a knife and divide the filling, spooning it over the yams. Place back in a warm oven until ready to serve.", "Garnish with fresh cilantro and scallions and a drizzle of “smoked” yogurt.", "To make the “smoked yogurt” mix all ingredients in a small bowl. Place in a squirty bottle and keep in the fridge."]
  },
  {
      "id": 6,
      "name": "Classic Minestrone Soup",
      "ingredients": ["4 tablespoons extra-virgin olive oil, divided", "1 medium yellow onion, chopped", "2 medium carrots, peeled and chopped", "2 medium ribs celery, chopped", "¼ cup tomato paste", "2 cups chopped seasonal vegetables (potatoes, yellow squash, zucchini, butternut squash, green beans or peas all work)", "4 cloves garlic, pressed or minced", "½ teaspoon dried oregano", "½ teaspoon dried thyme", "1 large can (28 ounces) diced tomatoes, with their liquid (or 2 small 15-ounce cans)", "4 cups (32 ounces) vegetable broth", "2 cups water", "1 teaspoon fine sea salt", "2 bay leaves", "Pinch of red pepper flakes", "Freshly ground black pepper", "1 cup whole grain orecchiette, elbow or small shell pasta", "1 can (15 ounces) Great Northern beans or cannellini beans, rinsed and drained, or 1 ½ cups cooked beans", "2 cups baby spinach, chopped kale or chopped collard greens", "2 teaspoons lemon juice", "Freshly grated Parmesan cheese, for garnishing (optional)"],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506669/MyVeggieWeek/vegetarian-minestrone-soup_zh9gkl.jpg",
      "instructions": ["Warm 3 tablespoons of the olive oil in a large Dutch oven or stockpot over medium heat. Once the oil is shimmering, add the chopped onion, carrot, celery, tomato paste and a pinch of salt. Cook, stirring often, until the vegetables have softened and the onions are turning translucent, about 7 to 10 minutes.", "Add the seasonal vegetables, garlic, oregano and thyme. Cook until fragrant while stirring frequently, about 2 minutes.", "Pour in the diced tomatoes and their juices, broth and water. Add the salt, bay leaves and red pepper flakes. Season generously with freshly ground black pepper.", "Raise heat to medium-high and bring the mixture to a boil, then partially cover the pot with the lid, leaving about a 1” gap for steam to escape. Reduce heat as necessary to maintain a gentle simmer.", "Cook for 15 minutes, then remove the lid and add the pasta, beans and greens. Continue simmering, uncovered, for 20 minutes or until the the pasta is cooked al dente and the greens are tender.", "Remove the pot from the heat, then remove the bay leaves. Stir in the lemon juice and remaining tablespoon of olive oil. Taste and season with more salt (I usually add about ¼ teaspoon more) and pepper until the flavors really sing. Garnish bowls of soup with grated Parmesan, if you’d like."]
  },
  {
      "id": 7,
      "name": "Roasted Cauliflower and Lentil Tacos with Creamy Chipotle Sauce",
      "ingredients": ["1 large head of cauliflower, sliced into bite-sized florets", "2 to 3 tablespoons olive oil", "Salt and freshly ground black pepper", "1 tablespoon olive oil", "1 cup chopped yellow or white onion", "2 large garlic cloves, pressed or minced", "2 tablespoons tomato paste", "½ teaspoon ground cumin", "½ teaspoon chili powder", "¾ cup brown lentils, picked over for debris and rinsed", "2 cups vegetable broth or water", "⅓ cup mayonnaise", "2 tablespoons lime juice", "2 to 3 tablespoons adobo sauce (from a can of chipotle peppers) or chipotle hot sauce to taste", "Salt and freshly ground black pepper, to taste", "8 small, round corn tortillas", "½ cup packed fresh cilantro leaves"],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506668/MyVeggieWeek/roasted-cauliflower-lentil-tacos_u30ppb.jpg",
      "instructions": ["To roast the cauliflower: Preheat oven to 425 degrees Fahrenheit. Toss cauliflower florets with enough olive oil to cover them in a light, even layer of oil. Season with salt and pepper and arrange the florets in a single layer on a large, rimmed baking sheet. Roast for 30 to 35 minutes, tossing halfway, until the florets are deeply golden on the edges.", "Warm the olive oil in a medium-sized pot over medium heat. Sauté the onion and garlic with a dash of salt for about 5 minutes, until the onions are softened and turning translucent. Add the tomato paste, cumin and chili powder and sauté for another minute, stirring constantly. Add the lentils and the vegetable broth or water. Raise heat and bring the mixture to a gentle simmer. Cook, uncovered, for 20 minutes to 45 minutes, until the lentils are tender and cooked through. Reduce heat as necessary to maintain a gentle simmer, and add more broth or water if the liquid evaporates before the lentils are done. Once the lentils are done cooking, drain off any excess liquid, then cover and set aside.", "To prepare the chipotle sauce, just whisk together the ingredients and set aside (if you have no choice but to use whole chipotle peppers from the can, use a blender to purée it all).", "Warm tortillas individually in a pan over medium heat. Stack the warm tortillas and cover them with a tea towel if you won’t be serving the tacos immediately.", "Once all of your components are ready, you can assemble your tacos! Top each tortilla with the lentil mixture, cauliflower, a drizzle of chipotle sauce and a generous sprinkle of chopped cilantro."]
  },
  {
      "id": 8,
      "name": "Vegetable Lasagna",
      "ingredients": ["2 tablespoons extra-virgin olive oil", "3 large carrots, chopped (about 1 cup)", "1 red bell pepper, chopped", "1 medium zucchini, chopped", "1 medium yellow onion, chopped", "¼ teaspoon salt", "5 to 6 ounces baby spinach", "1 large can (28 ounces) diced tomatoes", "¼ cup roughly chopped fresh basil + additional for garnish", "2 tablespoons extra-virgin olive oil", "2 cloves garlic, pressed or minced", "½ teaspoon salt", "¼ teaspoon red pepper flakes", "2 cups (16 ounces) low-fat cottage cheese, divided", "¼ teaspoon salt, to taste", "Freshly ground black pepper, to taste", "9 no-boil lasagna noodles", "8 ounces (2 cups) freshly grated low-moisture, part-skim mozzarella cheese"],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506822/MyVeggieWeek/best-vegetable-lasagna_mmlddx.jpg",
      "instructions": ["Preheat the oven to 425 degrees Fahrenheit.", "To prepare the veggies: In a large skillet over medium heat, warm the olive oil. Once shimmering, add the carrots, bell pepper, zucchini, yellow onion, and salt. Cook, stirring every couple of minutes, until the veggies are golden on the edges, about 8 to 12 minutes.", "Add a few large handfuls of spinach. Cook, stirring frequently, until the spinach has wilted. Repeat with remaining spinach and cook until all of the spinach has wilted, about 3 minutes. Remove the skillet from the heat and set aside.", "Meanwhile, to prepare the tomato sauce: Pour the tomatoes into a mesh sieve or fine colander and drain off the excess juice for a minute. Then, transfer the drained tomatoes to the bowl of a food processor. Add the basil, olive oil, garlic, salt, and red pepper flakes.", "Pulse the mixture about 10 times, until the tomatoes have broken down to an easily spreadable consistency. Pour the mixture into a bowl for later (you should have a little over 2 cups sauce). Rinse out the food processor and return it to the machine.", "Pour half of the cottage cheese (1 cup) into the processor and blend it until smooth, about 1 minute. Transfer the mixture to large mixing bowl. No need to rinse out the bowl of the food processor this time; just put it back onto the machine because you’ll need it later.", "Transfer the cooked veggies and spinach mixture to the bowl of the food processor. Pulse until they are more finely chopped (but not puréed!), about 5 to 7 times, stopping to scrape down the sides as necessary. Transfer the mixture to the bowl of whipped cottage cheese. Top with the remaining cottage cheese, then add ¼ to ½ teaspoon salt (to taste) and lots of freshly ground black pepper. Stir to combine. Now it’s lasagna assembly time!", "Spread ½ cup tomato sauce evenly over the bottom of a 9” by 9” baking dish. Layer 3 lasagna noodles on top (snap off their ends to fit, and/or overlap their edges as necessary). Spread half of the cottage cheese mixture evenly over the noodles. Top with ¾ cup tomato sauce, then sprinkle ½ cup shredded cheese on top.", "Top with 3 more noodles, followed by the remaining cottage cheese mixture (we’re skipping the tomato sauce in this layer.) Sprinkle ½ cup shredded cheese on top.", "Top with 3 more noodles, then spread ¾ cup tomato sauce over the top (you may have a little sauce leftover) to evenly cover the noodles. Sprinkle evenly with 1 cup shredded cheese.", "Wrap a sheet of parchment paper or foil around the top of the lasagna (don’t let it come into contact with the cheese). Bake, covered, for 18 minutes, then remove the cover, rotate the pan by 180° and continue cooking for about 10 to 12 more minutes, until the top is turning spotty brown.", "Remove from oven and let the lasagna cool for 15 to 20 minutes, so it has time to set and cool down to a reasonable temperature. Sprinkle additional basil over the top, then slice and serve."]
  },
  {
      "id": 9,
      "name": "Sweet Potato & Black Bean Quinoa Bake",
      "ingredients": ["4 cups sweet potatoes (1/2-inch cubes)", "1 (15 oz) can black beans, drained and rinsed", "1 cup uncooked quinoa, rinsed", "1 cup frozen corn, thawed", "2 cups vegetable broth", "1 tsp. chili powder", "2 tsp. cumin", "1 tsp. garlic salt", "1/2 tsp. dried thyme", "1/2 cup green onions, chopped"],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506823/MyVeggieWeek/sweet-potato-casserole_a5vlse.jpg",
      "instructions": ["Preheat oven to 375 degrees F.", "Combine all ingredients, except for the green onions, in a 9×13 baking dish sprayed with cooking spray and bake, covered with tin foil, for 45 minutes.", "Remove tin foil and continue baking for an additional 15 to 20 minutes until liquid is mostly absorbed and the potatoes are tender.", "Remove from oven and let the casserole sit for 5 minutes so that any remaining liquid can be fully absorbed and sprinkle with green onions. Serve and enjoy!"]
  },
  {
      "id": 10,
      "name": "Autumn Kale and Sweet Potato Salad",
      "ingredients": ["2 lbs. sweet potatoes", "1 Tbsp cooking oil", "1/4 tsp cinnamon", "1/2 tsp ground cumin", "1/4 tsp smoked paprika", "1/4 cup tahini", "1/4 cup water", "2 Tbsp lemon juice", "2 Tbsp maple syrup", "1/4 tsp garlic powder", "1/8 tsp cayenne pepper", "6 cups chopped kale (about 1/2 bunch)", "1 large apple", "1/4 cup pepitas", "1/4 cup chopped pecans", "1/4 cup dried cranberries"],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506823/MyVeggieWeek/Autumn-Kale-and-Sweet-Potato-Salad_kwwqhp.jpg",
      "instructions": ["Preheat the oven to 400ºF. Peel and dice the sweet potatoes into 1/2-inch pieces. Place the sweet potatoes on a parchment lined baking sheet and add the cooking oil, cinnamon, cumin, smoked paprika, and salt. Toss the sweet potatoes until they are coated in oil and spices.", "Roast the sweet potatoes for about 30 minutes, or until they are tender and browned on the edges, stirring once half way through.", "While the sweet potatoes are roasting, prepare the rest of the salad. Start with the dressing. Add the tahini, water, lemon juice, maple syrup, garlic powder, cayenne pepper, and salt to a blender or bowl. Blend or whisk together until the ingredients are emulsified and smooth. Set the dressing aside.", "Pull the kale leaves from the tough woody stems and rinse them well in a colander with cool water. Drain the kale well, then slice it into thin strips (they don't have to be perfect, so don't stress about this, just aim for smaller pieces). Divide the sliced kale between four bowls or containers.", "Cut the apple into quarters and remove the core. Cut each quarter into thin slices. Add the apple slices to each container.", "Add 1 Tbsp each of the pepitas, chopped pecans, and dried cranberries to each container. When the sweet potatoes are finished roasting, let them cool for about 5 minutes, then divide them between the containers. Divide the dressing between four small containers. Enjoy the salad immediately or refrigerate up to five days."]
  },
  {
      "id": 11,
      "name": "Kale and White Bean Powder Bowls",
      "ingredients": ["1 cup long grain brown rice", "1/4 cup olive oil", "3 Tbsp red wine vinegar", "1/2 Tbsp Dijon mustard", "1/2 Tbsp Italian seasoning", "1/4 tsp garlic powder", "1/4 tsp freshly cracked black pepper", "1/2 lb. chopped fresh kale (6 cups)", "1/2 Tbsp cooking oil", "1 clove garlic, minced", "1 15oz. can cannellini beans", "1/4 cup sun dried tomatoes", "1/4 cup chopped walnuts", "2 oz. feta"],
      "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506822/MyVeggieWeek/Kale-and-White-Bean-Power-Bowls_mdirwa.jpg",
      "instructions": ["Begin cooking the rice first. The remaining bowl ingredients can be prepared while the rice is cooking. Add the rice and 2 cups water to a saucepot. Place a lid on top and bring the water up to a full boil. Once boiling, turn the heat down to low and let the rice simmer for 40 minutes. After 40 minutes, turn the heat off and let the rice sit with the lid in place for an additional 5 minutes. Fluff just before serving.", "While the rice is cooking, make the vinaigrette so the flavors have a little time to blend. In a jar or bowl, combine the olive oil, red wine vinegar, Dijon, Italian seasoning, garlic powder, salt, and pepper. Whisk to combine, or close the jar and shake until combined. Set the dressing aside.", "Add the cooking oil and minced garlic to a large pot or skillet. Sauté the garlic over medium heat for about one minute. Add the chopped kale and salt. Sauté for a few more minutes, or just until the kale is wilted. Set the kale aside.", "Finally, prepare the rest of the toppings. Rinse and drain the white beans. Chop the sun dried tomatoes and walnuts. Crumble the feta.", "When the rice has finished cooking, it's time to assemble the bowls. Add about ¾ cup rice to each bowl or container, followed by ½ cup sautéed kale, ⅓ cup beans, and a tablespoon each of sun dried tomatoes and walnuts. Sprinkle a little feta over each bowl. Divide the vinaigrette between four small containers. Refrigerate until ready to eat.", "Reheat the bowls using a microwave just before serving, then drizzle with vinaigrette, stir, and enjoy!"]
  },
  {
    "id": 12,
    "name": "Balsamic Roasted Mushrooms & Herby Kale Mashed Potatoes",
    "ingredients": ["1 lb. mushrooms", "Olive oil", "3 Tbsp balsamic vinegar", "1/2 Tbsp brown sugar", "1 Tbsp soy sauce", "2 cloves garlic, minced", "1/4 tsp dried thyme", "2 lbs. russet potatoes", "6 oz. kale, chopped", "1/2 cup sour cream", "3/4 tsp salt, divided", "1/2 cup milk", "1 tsp dried parsley", "1/2 tsp dried oregano", "1/2 tsp dried basil", "1/4 tsp garlic powder", "1/4 tsp onion powder", "freshly cracked pepper"],
    "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506822/MyVeggieWeek/Balsamic-Roasted-Mushrooms-with-Herby-Kale-Mashed-Potatoes_bnbfut.jpg",
    "instructions": ["Preheat the oven to 400ºF. Wash the mushrooms and cut them in half if they are large.", "In a small dish, stir together the olive oil, balsamic vinegar, brown sugar, soy sauce, minced garlic, and thyme. Place the mushrooms in a casserole dish big enough to allow them to be in a single layer. Pour the balsamic marinade over top and stir until the mushrooms are coated.", "Transfer the the mushrooms to the preheated oven and roast for 45 minutes, giving them a stir every 15 minutes. After 45 minutes the mushrooms should be tender and there should be a nice sauce in the bottom of the dish.", "Meanwhile, prepare the mashed potatoes. Peel and dice the potatoes into one-inch cubes. Rinse the cubes well in a colander, then place them in a large pot, add 1/2 tsp salt, and cover with cool water. Place a lid on the pot, bring it up to a boil. Boil the potatoes until they are very tender (about 7-10 minutes).", "Once the potatoes are very tender, drain them in the colander and rinse them briefly with hot water. Let the potatoes drain in the colander as you prepare the kale.", "To the pot used to boil the potatoes, add the chopped kale, 1 Tbsp olive oil, and 2 Tbsp water. Sauté over medium heat just until wilted (3-5 minutes), then remove the kale from the pot.", "Return the drained potatoes to the pot along with the sour cream, milk, dried parsley, oregano, basil, garlic powder, onion powder, 1/4 tsp salt, and some freshly cracked pepper. Mash the potatoes until smooth, then taste and add more salt if needed. Stir in the sautéed kale.", "To make the bowls, add 1/4 of the herby kale mashed potatoes to each bowl, then top with 1/4 of the balsamic roasted mushrooms. Drizzle a spoonful or two of the juices from the bottom of the casserole dish over the mushrooms and mashed potatoes."]
  },
  {
    "id": 13,
    "name": "Chickpea Pancakes with Fennel & Olive Mega Mix",
    "ingredients": ["½ cup chickpea flour", "½ cup water", "¼ cup olives, pitted", "½ bulb fennel", "1 clove garlic (or garlic salt)", "1 handful basil, fresh", "2 tbsp vinegar", "1 tbsp mustard", "1 tsp maple syrup", "Olive oil", "Salt and pepper to taste"],
    "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506822/MyVeggieWeek/chickpea-flour-pancakes-fennel-olive_a3qnpp.jpg",
    "instructions": ["Filling: Cut the fennel into slices. Slice the olives. Chop or crush the garlic clove (if using). Grab a pot, set it to low heat. Sauté the fennel in a bit of olive oil (or a tbsp or two water) for 7 minutes. Then add the olives and garlic and fry for another 5 minutes.", "Pancakes: While that’s happening, Grab a bowl and add the chickpea flour and salt (or garlic salt). Pour in ½ cup water while mixing the batter properly with a fork. If you have a whisk, use that. Set a pan to medium heat, add olive oil and pour in half the batter. Fry for about 4-5 minutes. Flip, then fry for another 4-5 minutes. The pancake should come out crispy(ish).", "Sauce: In a small bowl, mix the vinegar, 2 tbsp water, 1 tsp olive oil, mustard, maple syrup, salt and pepper together. Once the pancakes are ready, plate them. Spread out fennel-olive mix and add a little fresh basil on top. Finish it all off with a proper drizzle of the mustard sauce."]
  },
  {
    "id": 14,
    "name": "Arugula Lentil Salad from Heaven",
    "ingredients": ["½ cup cashews", "1 onion", "1 tsp olive oil", "1 chilli / jalapeño", "4 sun-dried tomatoes in oil", "3 slices bread (whole wheat)", "1 cup brown lentils, cooked", "1 handful arugula/rocket", "2 tbsp balsamic vinegar", "1 small handful raisins", "1 tsp maple syrup", "salt and pepper to taste"],
    "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506822/MyVeggieWeek/arugula-lentil-salad_bzah4c.jpg",
    "instructions": ["Roast the cashews on a low heat for about three minutes in a pan to maximize aroma. Then throw them into the salad bowl.", "Dice up and fry the onion in olive oil for about 3 minutes on a low heat.", "Move the onion mix into a big bowl.", "Meanwhile chop the chilli/jalapeño and dried tomatoes. Cut the bread into big croutons. Add them to the pan and fry for another 2 minutes until the bread is crunchy. The oil from the sun-dried tomatoes should do.", "Season with salt and pepper.", "Wash the arugula and add it to the bowl. Add the raisins.", "Put the lentils in too. Season with salt, pepper, maple syrup and balsamic vinegar. Finally, serve with the croutons mix."]
  },
  {
    "id": 15,
    "name": "Peruvian Sandwich",
    "ingredients": ["1 tablespoon oil", "2 teaspoon garlic powder", "2 teaspoon ground cumin", "2 teaspoon paprika", "1 teaspoon dried oregano", "½ teaspoon black pepper", "½ teaspoon salt", "1 zucchini (courgette), sliced", "1 red bell pepper deseeded and cut into strips", "5 mushrooms cleaned and sliced", "1 red onion thinly sliced", "Juice of 1 lime", "2 tablespoon white vinegar", "2 Rolls", "½ Avocado sliced", "Parsley"],
    "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506822/MyVeggieWeek/Peruvian-Sandwich_gkurll.jpg",
    "instructions": ["Heat the oven to 400°F / 200°C.", "Mix the oil, spices and salt and pepper in a large bowl. Add the zucchini, pepper and mushrooms and toss to coat.", "Spread the vegetables in an even layer on a baking tray and bake for 15 minutes or until soft.", "Rinse the thinly sliced red onion and drain. Add to a bowl with the lime juice and vinegar and toss to coat. Leave for 10 minutes to marinate.", "To serve, cut the rolls and layer with avocado slices, pickled onions, roasted vegetables and top with parsley."]
  },
  {
    "id": 16,
    "name": "Aubergine Curry",
    "ingredients": ["½ cup basmati rice", "1 aubergine", "1 tbsp olive oil", "1 red onion", "2 clove garlic", "1 tsp garam masala powder or curry powder", "1 tsp turmeric", "1 tsp ground coriander", "1 tin tomatoes", "1 ½ cups low fat coconut milk", "½ tsp salt", "½ tsp pepper", "1 tsp sugar (optional)"],
    "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506885/MyVeggieWeek/aubergine-arrabiata_ewzqph.jpg",
    "instructions": ["Cook rice according to packet instructions.", "Cut the aubergine into small cubes. Fry in a large pan with the olive oil on high heat for 3-4 minutes. Stir well so it doesn’t burn.", "In the meantime dice the onion and throw it in too. Put it back to a medium heat and cook for 5-6 minutes.", "Crush or dice the garlic.", "Stir in the garlic, garam masala, turmeric and ground coriander. Cook for another 3-4 minutes, stirring well.", "Pour in the chopped tomatoes and coconut milk. Add salt. Simmer for about 15 minutes. The coconut milk thickens so stop cooking when it is at the right consistency for you. Stir in the sugar or mango chutney if you like it a little sweeter.", "Serve with salt and pepper to taste."]
  },
  {
    "id": 17,
    "name": "Chinese Eggplant with Spicy Szechuan Sauce",
    "ingredients": ["1 1/2 lbs Japanese Eggplant  (about 4 x 10 inch eggplants)", "2 teaspoons salt", "Bowl of water", "2 tablespoons cornstarch", "2–4 tablespoons peanut oil ( or wok oil)", "4 cloves garlic, rough chopped", "2 teaspoons ginger, finely minced", "5–10 dried red chilies", "1 teaspoon Szechuan peppercorns ( or sub regular peppercorns)", "1/4 cup soy sauce or low sodium soy sauce", "1 tablespoon garlic chili paste ( or sub 1 teaspoon chili flakes)", "1 tablespoon sesame oil", "1 tablespoon rice vinegar", "1 tablespoon Chinese cooking wine (or mirin)", "3 tablespoons sugar, brown sugar, coconut sugar, maple syrup  or alternative", "1/2 teaspoon five spice"],
    "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506885/MyVeggieWeek/Szechuan-Eggplant_viyxzm.jpg",
    "instructions": ["Cut eggplant into 1/2 inch thick half-moons or into bite-sized pieces ( see photos). Place in a big bowl covered with water and stir in 2 teaspoons salt. Cover with a plate and let stand 20-30 minutes.", "In the meantime, chop the garlic and ginger and make the Szechuan Sauce.", "To make the Szechuan Sauce: Toast the Szechuan peppercorns in a dry skillet over medium heat for 1-2 minutes. Crush. Place these along with the remaining ingredients ( soy, chili paste, sesame oil, rice vinegar, Chinese cooking wine, sugar, and five spice) in a small bowl and whisk. Set by the stove.", "Drain and rinse the eggplant and pat dry with a towel. Toss with the corn starch.", "Working in 2 batches, heat 1 -2 tablespoons oil in an extra-large skillet over medium heat. Add half the eggplant spreading them out. You want to get both sides nice and golden, and the insides cooked through -so take your time here and dont rush this step. Let one side brown then turn them over using tongs. This will take about 10 minutes for each batch.  ( If in a hurry sometimes I’ll use 2 pans.) Set the eggplant aside.", "Add 1 more tablespoon oil to the skillet, and over medium heat, add the garlic and ginger, stirring for 2 minutes. Turn the fan on, add the dried chilis and stir one minute. Pour the Szechuan sauce into the pan and bring to a simmer for 20 seconds. Add the eggplant back into the skillet, tossing gently for about 1 minute. If it seems dry add a tablespoon of water to loosen.", "Place in a serving dish and top with scallions and optional peanuts.", "Serve with rice, cauliflower rice, black rice or rice noodles."]
  },
  {
    "id": 18,
    "name": "Bombay Burritos",
    "ingredients": ["16 ounces baby potatoes – quartered", "1 tablespoon ghee, olive oil or coconut oil, more to taste", "¾ teaspoon kosher salt", "2–3 teaspoons yellow curry powder", "1 teaspoon granulated onion or granulated garlic powder", "1 head cauliflower- cut into small florets", "1 can chickpeas, rinsed and drained well", "1 tablespoon coriander", "1 tablespoon cumin", "generous pinch chili flakes", "1 teaspoon whole fennel seed ( optional, or use cumin seed or coriander seed)", "1 teaspoon whole coriander seed", "4 x extra-large, whole wheat tortillas – or feel free to use GF wraps or tortillas, or GF bowls using the mashed potatoes and extra spinach and the base.", "2 handfuls baby spinach", "Few tablespoons Cilantro Mint Chutney (imperative!!!)", "Few tablespoons Quick Pickled Onions"],
    "imgURL": "https://res.cloudinary.com/dqh1l02dr/image/upload/v1618506885/MyVeggieWeek/Frankie-Recipe-Indian-Burrito_rapwn1.jpg",
    "instructions": ["Preheat oven to 425F", "START POTATOES: Cut potatoes and place them in a medium pot, covered with water and simmer until very tender, about 15-20 minutes.  At the same time…", "ROAST VEGGIES: Cut the cauliflower into small florets and place them on a parchment-lined sheet pan ( to one side). Add the drained chickpeas to the other side. Drizzle both with olive oil. Sprinkle cauliflower and chickpeas with the spices and salt, tossing to coat well. Place in the oven and roast for 20-25 minutes tossing halfway through) or until cauliflower is tender.", "SAUCE: Make the flavorful Cilantro Mint Chutney and quick pickled red onions and place both in jars (of course, you could make these both ahead). They take about 5-10 minutes each. Please don’t leave out the mint chutney- it’s imperative!!!", "CURRIED POTATOES: Once the potatoes are very tender, drain but save about 1 cup of the hot water. Place the potatoes back in the pot and mash with some of the hot water ( start with ¼-½ cup ) salt, spices and ghee (or oil) and mash the potatoes to combine until smooth. You want a fairly loose, spreadable mash so add more hot water if necessary. Scrape down the sides. Stir well.  Taste. You want this to taste flavorful and slightly salty as the tortilla will mute some of the salt and flavor. Feel free to add more ghee or oil as you please for extra richness. Cover and keep warm.", "When the roasted veggies are done, ASSEMBLE: Warm the tortillas either in the oven, over a gas flame or over a grill, until soft and pliable. Spread generously with the curried potatoes, then top with chickpeas, cauliflower making sure to get some of the whole spices that will have dropped to the bottom of the pan. Add a handful of spinach leaves, a few teaspoons of cilantro mint chutney and some pickled onions and roll up like a burrito. Keep warm in the oven until ready to serve, or serve immediately! You can also refrigerate and reheat for meals on the go."]
  },
  {
    "id": 19,
    "name": "Roasted Brussels Sprouts and Crispy Baked Tofu with Honey-Sesame Glaze",
    "ingredients": ["1 ¼ cup brown rice, preferably short grain", "1 ½ pounds Brussels sprouts", "Extra-virgin olive oil", "Fine grain sea salt", "1 block (15 ounces) organic extra-firm tofu", "1 tablespoon arrowroot starch or cornstarch", "Reduced-sodium tamari or soy sauce", "3 tablespoons honey or maple syrup", "2 tablespoons rice vinegar", "2 teaspoons toasted sesame oil", "1 to 3 teaspoons chili garlic sauce or sriracha (depending on how spicy you like it)", "2 tablespoons sesame seeds (I used black sesame seeds but regular white are fine as well)", "Big handful fresh cilantro leaves, torn by hand"],
    "imgURL": "https://cookieandkate.com/images/2014/04/roasted-brussels-sprouts-and-crispy-baked-tofu-rice-recipe-4-550x824.jpg",
    "instructions": ["Prep work: Position your oven racks in the lower third and upper third of the oven.Preheat oven to 400 degrees Fahrenheit. Line two large, rimmed baking sheets with parchment paper for easy cleanup (and to prevent the tofu from sticking). Bring a large pot of water to boil for the rice. Rinse the rice in a fine mesh colander under running water and set aside.", "Drain the tofu and use your palms to gently squeeze out some of the water. Slice the tofu into thirds lengthwise so you have 3 even slabs. Stack the slabs on top of each other and slice through them lengthwise to make 3 even columns, then slice across to make 5 even rows (see photos).", "Line a cutting board with an absorbent lint-free tea towel or paper towels, then arrange the tofu in an even layer on the towel(s). Fold the towel(s) over the cubed tofu, then place something heavy on top (like another cutting board, topped with a cast iron pan or large cans of tomatoes) to help the tofu drain. Let the tofu rest for at least 10 minutes while you prep the Brussels sprouts.", "Trim the nubby ends and any discolored leaves off the Brussels sprouts, then cut the sprouts in halves lengthwise. Toss the sprouts with a light, even layer of olive oil. On a large baking sheet, arrange the sprouts in an even layer, flat sides down, and sprinkle with sea salt.", "Transfer the pressed tofu to one of your prepared baking sheets and drizzle with the olive oil and tamari. Toss to combine. Sprinkle the arrowroot starch over the tofu, and toss the tofu until the starch is evenly coated, so there are no powdery spots remaining. Arrange the tofu in an even layer across the pan.", "To cook the rice: Once the water is boiling, add the rice. Let the rice boil for 30 minutes, then remove from heat and drain the rice. Transfer the drained rice back to the cooking pot and cover for 5 minutes. Remove lid, add a dash of sea salt and use a fork to fluff the rice. Set aside, partially covered, until you’re ready to serve.", "To bake the sprouts and tofu: Transfer the pan of Brussels sprouts to the lower oven rack, and the pan of tofu to the top rack. Bake for 25 to 30 minutes, tossing the contents of each pan halfway through cooking, until the sprouts and tofu are deeply golden on the edges.", "To make the glaze: In a small saucepan, whisk together the glaze ingredients (start with 1 teaspoon chili garlic sauce or sriracha and add more to taste). Bring the glaze to a gentle boil over medium heat, stirring often and reducing heat as necessary. Simmer until the glaze is reduced by about half (about 5 to 10 minutes; it’s about done when it starts bubbling up substantially). Remove the glaze from the heat and set aside.", "To assemble: Divide the rice onto four plates. Top each plate with sprouts and tofu and drizzle with glaze. Finish each plate with a very generous sprinkling of sesame seeds and a small handful of chopped cilantro."],
    "source": "https://cookieandkate.com/roasted-brussels-sprouts-and-crispy-baked-tofu-with-honey-sesame-glaze/#tasty-recipes-23548-jump-target"
  }
]
